## Pandas Basis

In [1]:
# import necessary package
import pandas as pd
import numpy as np

In [2]:
# generate a dataset and convert to pandas dataframe

data = {'name': ['Jack', 'Annie', 'Bob', 'Jake', 'Jasper'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'grades': [4, 20, 15, 7, 24],
        'coverage': [25, 94, 57, 62, 70]}

df = pd.DataFrame(data, index = ['Cochic', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

            coverage  grades    name  year
Cochic            25       4    Jack  2012
Pima              94      20   Annie  2012
Santa Cruz        57      15     Bob  2013
Maricopa          62       7    Jake  2014
Yuma              70      24  Jasper  2014

#### 1. Show the first three rows and last two rows.

In [3]:
#first three rows
df.head(3)

            coverage  grades   name  year
Cochic            25       4   Jack  2012
Pima              94      20  Annie  2012
Santa Cruz        57      15    Bob  2013

In [4]:
#last two rows
df.tail(2)

          coverage  grades    name  year
Maricopa        62       7    Jake  2014
Yuma            70      24  Jasper  2014

#### 2. Generate a new dataframe including county,year and reports from above datafram (county and reports can be NaN)

In [ ]:
df_new = pd.DataFrame()

#### 3. Add a new column attribute called "New", which is NaN.

#### 4. Delete the column "New".

#### 5. Show the index and columns name.

#### 6. Use df.iloc to select the first row

#### 7. Slice the column of "coverage" and "grades".

#### 8. select subtable of column name and year, row of Pima and Yuma

#### 9. Use df.iloc to select the first two columns

#### 10. Select by condition where grades greater than 10

#### 11. Drop Rows of Cochic and Pima

#### 12. Use df.drop to drop the column grades.

#### 13. Use decribe function to show some statistics of column "coverage".

### Pandas Fast Visualization

Read the following reading materials:<br/>
https://pandas.pydata.org/pandas-docs/stable/visualization.html